<template>
  <div>
    <el-card class="mm-match" shadow="hover" v-for="(item,i) in contents" :key="i">
      <div
        class="match-image"
        :style="{'background-image':`url(`+require(`./img/match${i+1}.jpg`)+`)`}"
      ></div>

      <div class="title">
        <span>{{item}}</span>
      </div>
    </el-card>
  </div>
</template>

<script>
export default {
  data() {
    return {
      contents: [
        "意式脆饼：即使在美国，也是最常见的搭配咖啡的食物之一，并且有多种口味，包括杏仁，樱桃，和巧克力等。",
        "蛋糕：作为与咖啡的经典搭配之一，不同口味的蛋糕适合不同风味的咖啡。比如，胡萝卜蛋糕适合搭配哥伦比亚咖啡，而巧克力蛋糕则适合搭配中度至深度烘培咖啡，比如曼特宁等。",
        "焦糖布丁：丰厚的口感更适合与印尼咖啡和危地马拉咖啡搭配。",
        "牛角面包：最适合与咖啡和牛奶比例为1:1的法式咖啡一起享用。",
        "松饼：松饼适合于大多数咖啡，但搭配哥斯达黎加和墨西哥咖啡为最佳。",
        "司康饼：没错，除了与茶的完美搭配，司康饼也可以是咖啡的最佳伴侣。水果口味司康饼最适合来自也门，肯尼亚和海地的略带酒味的咖啡，原味司康饼可以搭配哥斯达黎加咖啡。",
        "与水果搭配在强调健康生活方式的今天，水果与咖啡的搭配成为新选择。",
        "酸性水果：肯尼亚和哥斯达黎加咖啡都适合搭配各种梅子类浆果，不过也门和牙买加咖啡与蓝莓的组合就更上一层。",
        "亚酸性水果：这类水果最适合与危地马拉、耶加雪菲等咖啡搭配。",
        "甜性水果：水果馅饼和中度至深度烘培的巴西和哥斯达黎加咖啡是完美搭配。",
        "布朗尼：质地醇厚的印尼和危地马拉咖啡最适合与黑巧克力布朗尼搭配。",
        "蘸巧克力酱的水果：与大多数非洲的咖啡搭配都是不错的选择。具体一点，裹覆巧克力酱的樱桃果馅饼与西达摩搭配味道最佳。",
        "白巧克力：适合与哥伦比亚、哥斯达黎加、也门咖啡搭配。",
        "鸡蛋卷配蘑菇、罗勒、山羊奶酪：适合爪哇，苏门答腊和印尼咖啡。",
        "薄煎饼配枫糖液：同样是哥伦比亚、巴西、哥斯达黎加等轻度或中度烘焙的咖啡。"
      ]
    };
  }
};
</script>

<style scoped lang="scss">
.mm-match {
  margin-bottom: 20px;
  .match-image {
    height: 500px;
    background-size: 100% 100%;
  }

  .title {
    margin-top: 5px;
  }
}
</style>