<template>
  <!-- accordion -->
  <el-collapse v-model="activeName">
    <el-collapse-item title="咖啡的利" name="1">
      <div>
        咖啡豆含有大约100种不同的物质，包括咖啡因、单宁酸、油和氮化合物等，每100克速溶咖啡中，
        含咖啡因44～100毫克；每100克调制咖啡中，含咖啡因64～124毫克。咖啡是一种兴奋剂，对人体会产生很多影响，
        它可利尿、刺激中枢神经和呼吸系统、扩大血管、使心跳加速、增强横纹肌的力量以及缓解大脑和肌肉疲劳。
      </div>
    </el-collapse-item>

    <el-collapse-item title="咖啡的弊" name="2">
      <div>1．习惯大量饮用咖啡的人停止饮用咖啡，会出现头痛、易怒、肌肉紧绷和神经过敏等症状，而摄入咖啡因才症状消失。</div>
      <div>2．怀孕及哺乳期间的妇女饮用咖啡应适量，因为咖啡因会渗透至胎盘，而且会进入到母乳里。</div>
      <div>3．喝咖啡会引起人的精神兴奋，在喝完咖啡的4小时内，咖啡因会影响睡眠。</div>
    </el-collapse-item>

    <el-collapse-item title="咖啡与健康" name="3">
      <div>咖啡是否影响健康是很多人都极为关心的话题，多年以来科学家之间争论不休。</div>
      <div>在1970至1980年间，这方面研究的结果通常是负面的。广泛的媒体报道使人们对他们饮食内所含的咖啡因感到不安。</div>
      <div>
        进入90年代，由于更严密精确的测验过程及对其他方面更多的了解，例如酒精的消耗，运动习惯和抽烟，
        这些研究已经能够澄清在从前的研究中一些未解决的争论。特别是已经能提供很多有关咖啡因和健康方面的新知识。
      </div>
      <div>2017年10月27日，世界卫生组织国际癌症研究机构公布的致癌物清单初步整理参考，咖啡因在3类致癌物清单中。</div>
    </el-collapse-item>

    <el-collapse-item title="咖啡上瘾问题" name="4">
      <div>
        英格兰一间大学请来300个志愿者参与研究，将咖啡迷与非咖啡迷分成两组，于测试前的16小时停止饮用咖啡，观察他们集中力的变化。
        “戒咖啡”16小时后，只有咖啡迷获准饮用咖啡，非咖啡迷不准饮用，结果却显示，饮用了咖啡的人，其集中力与非咖啡迷一样，仅属正常水平。
        故此推算，即使非咖啡迷饮用咖啡，亦不会有助提升专注力或工作效率。
      </div>
      <div>
        负责调查的学者称，人体内脏减慢反应的腺甘酸（Adenosine），在喝咖啡后感到“提神”，是因为咖啡因停止腺甘酸进入细胞，
        令人不易产生睡意。研究又指，咖啡因会令到血管收窄，加速血液运行速度，形成头痛。
        有些咖啡迷不喝咖啡会出现头痛、易怒、肌肉紧绷和神经过敏等不适反应。
      </div>
    </el-collapse-item>

    <el-collapse-item title="喝咖啡是否影响睡眠" name="5">
      <div>
        许多人都有喝了咖啡后因精神亢奋而睡不着的经验，这是因为人体内有一种叫做腺甘酸的传导物质，它能够控制神经活动，
        产生呼吸减缓、情绪减弱、降低胃酸分泌和利尿作用。而咖啡因会假冒腺甘酸，使体内以为腺甘酸的作用已经发生，
        让你感到精神充沛、胃酸增加、较为频尿，自然也较不容睡着，值得注意的是，这种咖啡因造成的短暂清醒，
        并不表示体力真的获得恢复。此外，每个人对咖啡因的新陈代谢速度不同，对其敏感度也就有所差异，所以有人在喝了咖啡后，
        并不觉得睡眠受到影响。因此，早上起床后来一杯热咖啡，可以振奋身心，让心情更加舒畅，而晚上则可能会造成失眠。
      </div>
    </el-collapse-item>

    <el-collapse-item title="是否会造成钙质流失" name="6">
      <div>
        由于人们对于钙质流失和骨质疏松的问题越来越重视，对于咖啡也产生相当的疑惑。至于咖啡因的摄取和骨质疏松症的关系，
        仍在持续研究中，并没有直接证据显示咖啡因会导致骨质疏松症，但是某些研究则指出咖啡因会增加钙质的流失。
        因此在此建议咖啡爱好者应该多吃些高钙食品来补充钙质，如准备芝士片或芝士蛋糕等搭配咖啡享用，不仅能补充钙质，还能使咖啡更加美味。
      </div>
    </el-collapse-item>

    <el-collapse-item title="咖啡与美容" name="7">
      <div>
        没有任何一项研究结果显示咖啡中的咖啡因、黑色素与皮肤黑色素增加或令皮肤老化有绝对的关系。相反地，适量的咖啡因会加速新陈代谢、
        促进消化、改善便秘，并能够改善皮肤的粗糙现象。关于咖啡因能加速新陈代谢，有一种说法是咖啡会加速燃烧卡路里，
        达到减肥的功效，基本上理论是正确的，但是这种卡路里的燃烧还不至于让体重减轻多少，如果咖啡里还加了糖和奶精，
        从热量上的计算是更不符合减肥的原则了。
      </div>
    </el-collapse-item>

    <el-collapse-item title="咖啡是健身的好朋友" name="8">
      <div>
        咖啡的另一个优点，是能增强体力，这有助于你锻炼更长时间，使锻炼效果更好。咖啡因是团体性运动中必不可少的东西，
        因为它能增强注意力和反应能力。饮用太多咖啡，再加上激烈运动，
        可能会导致心动过速和兴奋，引发失眠、神经失常等症状。
      </div>
    </el-collapse-item>
  </el-collapse>
</template>

<script>
export default {
  data() {
    return {
      activeName: "1"
    };
  }
};
</script>

<style scoped lang="scss">
.el-collapse /deep/ {
  .el-collapse-item__header {
    padding: 0 20px;
  }

  .el-collapse-item__content {
    text-indent: 2em;
    padding: 0 20px 20px;
  }
}
</style>